电脑/html5/javascript语言/javascript语言学习进阶.org


#+TITLE: javascript语言学习进阶
#+AUTHOR: 万泽(德山书生)
#+CREATOR: wanze(<a href="mailto:a358003542@gmail.com">a358003542@gmail.com</a>)
#+DESCRIPTION: 制作者邮箱：a358003542@gmail.com



* JSON对象
json之前了解过一些了:
#+BEGIN_EXAMPLE
number：和JavaScript的number完全一致；
boolean：就是JavaScript的true或false；
string：就是JavaScript的string；
null：就是JavaScript的null；
array：就是JavaScript的Array表示方式——[]；
object：就是JavaScript的{ ... }表示方式。
#+END_EXAMPLE

** stringify函数
某个javascript对象字符串化。
#+BEGIN_EXAMPLE
JSON.stringify(xiaoming, null, '  ');
#+END_EXAMPLE


** parse函数
将某个javascript对象刷成json对象。
#+BEGIN_EXAMPLE
JSON.parse('[1,2,3,true]'); 
#+END_EXAMPLE







* 用javascript改变网页全局的css设置
参考了 [[http://stackoverflow.com/questions/566203/changing-css-values-with-javascript][这个网页]] 。

#+BEGIN_SRC js
function change_general_css(selector, property, value) {
    for (var i=0; i<document.styleSheets.length;i++) {//Loop through all styles
        //Try add rule
        try { document.styleSheets[i].insertRule(selector+ ' {'+property+':'+value+'}', document.styleSheets[i].cssRules.length);
        } catch(err) {try { document.styleSheets[i].addRule(selector, property+':'+value);} catch(err) {}}//IE
    }
}
#+END_SRC


* 参考资料
1. [[http://bonsaiden.github.io/JavaScript-Garden/zh/][javascript秘密花园]] 
